// В этом файле изучим новую интересную фичу, двоичный литерал

#include <iostream>

// До С++14 можно было писать 8, 10, 16-ричные числа

// Теперь можно и двоичные!
int binary_num = 0b11111111;
// Это очень удобно при работе с битовыми масками

int main()
{
    // Также добавили разделители для всех систем счисления
    // Двоичная: разбиваем по 4 или 8 бит (байтам)
    auto mask = 0b1101'1010'0001'1100;

    // Десятичная: разделяем тысячи и миллионы
    long population = 8'000'000'000;

    // Шестнадцатеричная: разделяем байты
    auto color = 0xFF'A0'50'00;

    // Числа с плавающей точкой
    double pi = 3.141'592'653'589;



    return 0;
}
