#include <iostream>
#include <memory>

// В этом файле изучаем New/Delete Elision в С++14

// Суть: Начиная с C++14, компиляторам официально разрешили УСТРАНЯТЬ (пропускать)
// вызовы new и delete или ОБЪЕДИНЯТЬ несколько выделений памяти в одно
// Выделение памяти в куче (heap) — очень дорогая операция.
// Перенос на стек или объединение вызовов дает огромный прирост скорости.

void demo_elision()
{
    // В C++14 компилятор может не вызывать `operator new` в куче,
    // а выделить память под 'p' прямо на СТЕКЕ функции demo_elision,
    // потому что p не выходит за пределы функции.
    int* p = new int(100);

    std::cout << *p << '\n';

    delete p; // Вызов delete тоже будет устранен компилятором
}

// Это хорошая оптимизация компилятора
int main()
{
    demo_elision();
    return 0;
}
