// В этом файле изучим работу constexpr С++14

#include <iostream>

// В С++11 constexpr был ограничен. Там можно было
// делать только return, без if, циклов, локальных переменных

// Теперь все ограничения сняли. Теперь constexpr может
// стать серьезной функцией например


constexpr int sum(int n)
{
    int s = 0; // Можно теперь создавать локальные функции

    for (int i = 0; i < n; i++) // Возможны даже циклы
        s+= i;

    return s;
}


int main()
{
    constexpr int num = sum(5); // Вычисления на этапе компиляции
    // Переменная тоже должна быть constexpr
    std::cout << num << '\n';

    int new_num = sum(num); // Тут вычисления во время работы
    // программы. Надо передавать заранее известные литералы

    return 0;
}
