// В этом файле изучим изменения касающийся noexpect

// До C++17, noexcept функция и обычная функция были одним типом:
// void fun1();
// void fun2() noexcept;
// У них типы одинаковые

// Начиная с C++17, noexpect функции стали иметь отдельный тип
// Что это значит? Это значит что указатель на функцию с noexpect,
// не может указывать на функцию без noexpect

// Несмотря на разные типы, нельзя перегружать функции только по noexcept:
// void foo();
// void foo() noexcept; // Ошибка компиляции

void safe_func() noexcept {}
void unsafe_func() {}

int main()
{
    // Указатель с гарантией noexcept
    void (*ptr_safe)() noexcept = safe_func; // Будет работать

    // Неявное приведение в сторону ослабления гарантий - разрешено
    void (*ptr_any)() = safe_func; // Будет работать

    // Попытка записать обычную функцию в noexcept-указатель - ОШИБКА:
    // ptr_safe = unsafe_func; // Ошибка компиляции в C++17

    return 0;
}
