// В этом файле изучим новые правила порядка вычисления (Order of Evaluation) в C++17

#include <iostream>

// До С++17 порядок вычислений во многих выражениях был не определён (UB/Unspecified).
// В C++17 сделали порядок вычислений более строгим для критических операций

int trace(int id)
{
    std::cout << id << " ";
    return id;
}

void func(int a, int b) {}

int main()
{
    // Операторы сдвига / цепочки вызовов (Строго слева направо):
    std::cout << trace(1) << trace(2) << trace(3) << '\n';

    // Присваивание (Правая часть вычисляется РАНЬШЕ левой):
    int i = 0;
    int arr[2] = {0, 0};
    arr[i] = trace(99); // trace(99) выполнится ДО определения адреса arr[i]

    // Списки инициализации {} (Строго слева направо):
    auto lst = { trace(10), trace(20) }; // Сначала 10, затем 20

    // Обычные аргументы функций (через запятую) ВСЁ ЕЩЁ НЕ определены!
    // Порядок вызова trace(1) и trace(2) здесь по-прежнему зависит от компилятора:
    func(trace(1), trace(2));

    return 0;
}
