// В этом файле изучим работу static и глобальных переменных в C++17

// До С++17 нельзя было инициализировать static поля класса в хедере
// (за исключением редких случаев с const int/enum).
// В С++17 решили эту проблему. При объявлении класса
// в заголовочном файле (хедере) теперь можно инициализировать
// static поля класса и глобальные переменные прямо на месте.

// Для этого надо добавить inline перед переменными.
class Car
{
public:
    inline static int speed = 250; // Доступно прямо в хедеере
};

// Даже если в нескольких исходниках (.cpp) подключится этот хедер,
// благодаря inline будет создана ровно одна глобальная переменная в памяти.
inline int bmw = 333;

int main()
{
    // Проверка доступа:
    // std::cout << Car::speed << '\n'; // 250
    // std::cout << bmw << '\n';        // 333
    return 0;
}
